tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "kdabir/tap"
tap "sebglazebrook/aliases"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cross-platform make
brew "cmake"
# Distributed revision control system
brew "git"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# YAML Parser
brew "libyaml"
# General-purpose scripting language
brew "php"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Safe, concurrent, practical language
brew "rust"
# Internet file retriever
brew "wget"
# checks presence of various command line tools and their versions on the path
brew "kdabir/tap/has"
# Bash aliases on steroids
brew "sebglazebrook/aliases/aliases"
# Minimal installer for conda
cask "miniconda"
